# 列表操作的各种方法--->list
L1 = ["1",'2',"3","4","5","6","7","8","9","10"]
La = ["1",'2',"3","4","5","6","7","8","9","10"]
# 增加列表元素insert(),append(),extend
# insert 插入
L1.insert(-1,"11")  # 在最后一位插入"11"
print("insert插入元素：",L1)
# append 末尾添加
L1.append("11") # 在列表末尾添加一个元素
print("append向list末尾添加一个元素：",L1)
# extend 添加一个列表
L1.extend(La)
print("extend向list追加另外一个list2：",L1)

L2 = ["1",'2',"3","4","5","6","7","8","9","10"]
# pop删除列表元素
L2.pop(6) # 删除列表最后一个元素，-1可省去
print("pop通过索引删除索引为6的元素：",L2)
# remove 删除列表元素
L2.remove("9")
print("remove通过元素名删除指定元素",L2)
# clear清空列表
L2.clear()
print("clear清空列表：",L2)
"""
拓展：del 删除列表元素或者列表，不建议对列表操作，
del实质上是将变量从内存中去除
"""
L3 = ["1",'2',"3","4","5","6","7","8","9","10"]
# 修改list元素
L3[1]="A" # 将索引为1的元素更改为“A”
print(L3)
L4 = ["1",'2',"3","4","5","6","7","8","9","10"]
# 通过索引查元素
print("索引为0的元素是：",L4[0])
# 通过元素查索引
print("元素1的索引是：",L4.index("1"))
# 查询列表长度，或者列表中元素的个数
print("L4的元素个数是(列表长度)：",len(L4))
# 统计元素在列表中出现的次数
L4.append("7")
print("元素7在L4中出现的次数是：",L4.count("7"))
L5 = [1,2,3,4,5,6,7,8,9,10,11]
# 列表排序操作
# 升序
# print(L5)
L5.sort()
print("L5的升序是：", L5)
# 降序
L5.sort(reverse=True)
print("利用sort对L5的降序是：", L5)
L6 = ['A','S','F','E','R','T','F',2]
# reverse 反转 即将L6首尾顺序反转，并不排序，切记
L6.reverse()
print("利用reverse对L5反转结果是：",L6)




