
y = [[x for x in range(1,101)][i:i+3] for i in range(0,100,3)]

for a in y:
    print(a)

# 看着挺长的一句代码，别怕，兄弟，我们来拆一下就明白了
# [x for x in range(1,101)]  # 生成一个[1,2,3......100]的列表
# [i:i+3] for i in range(0,100,3)  # 这一句代码主要就是切片作用

# 所以我们这个列表推导式实现的功能就是：将1-100每搁3个元素切片一次


#例2： [[1,2],[3,4],[5,6]]一行代码展开该列表，得出[1,2,3,4,5,6]
b=[[1,2],[3,4],[5,6]]
print([i for j in b for i in j])
#[i for j in b for i in j]拆解一下
#1. [for j in b]:遍历三次，分别得到j=[1,2],[3,4],[5,6]
#2.[for i in j]:遍历六次，分别得到i=1,2,3,4,5,6
#3.返回i=[1,2,3,4,5,6]

